{
  "content": {
    "acid-cap-theorem@bbKEEk7dvfFZBBJaIjm0j": "# ACID & CAP Theorem\n\nACID (Atomicity, Consistency, Isolation, Durability) and CAP (Consistency, Availability, Partition Tolerance) are essential concepts in distributed systems. They are often used to explain the trade-offs between consistency and availability.\n\nCAP is an acronym for Consistency, Availability, and Partition Tolerance. According to the CAP theorem, any distributed system can only guarantee two of the three properties at any time. You can't guarantee all three properties at once.\n\nACID is an acronym that stands for Atomicity, Consistency, Isolation, Durability. ACID is a set of properties of database transactions intended to guarantee validity even in the event of errors, power failures, etc.\n\nVisit the following resources to learn more:\n\n- [@article@What is CAP Theorem?](https://www.bmc.com/blogs/cap-theorem/)\n- [@article@CAP Theorem - Wikipedia](https://en.wikipedia.org/wiki/CAP_theorem)\n- [@article@An Illustrated Proof of the CAP Theorem](https://mwhittaker.github.io/blog/an_illustrated_proof_of_the_cap_theorem/)\n- [@article@CAP Theorem and its applications in NoSQL Databases](https://www.ibm.com/uk-en/cloud/learn/cap-theorem)\n- [@video@What is CAP Theorem?](https://www.youtube.com/watch?v=_RbsFXWRZ10)\n- [@article@ACID - Wikipedia](https://en.wikipedia.org/wiki/ACID)\n",
    "actors@AoWO2BIKG5X4JWir6kh5r": "# Actors\n\nActor Model is a model that represents actors as the basic unit of a system, they can only communicate through messages and have their own private state, and they can also manage other actors, resulting in an encapsulated and fault-tolerant system.\n\nVisit the following resources to learn more:\n\n- [@video@Actor Model Explained](https://www.youtube.com/watch?v=ELwEdb_pD0k)\n- [@article@The actor model in 10 minutes](https://www.brianstorti.com/the-actor-model/)\n",
    "apache-spark@a0baFv7hVWZGvS5VLh5ig": "# Apache spark\n\nApache Spark is a multi-language engine for executing data engineering, data science, and machine learning on single-node machines or clusters.\n\nVisit the following resources to learn more:\n\n- [@official@Apache Spark](https://spark.apache.org/)\n- [@feed@Explore top posts about Apache](https://app.daily.dev/tags/apache?ref=roadmapsh)\n",
    "apis--integrations@Ocn7-ctpnl71ZCZ_uV-uD": "# APIs and Integrations\n\nAPIs (Application Programming Interfaces) are essential for enabling communication between different software applications, allowing them to share data and functionality seamlessly. They serve as the bridge that connects disparate systems, making it possible for applications to interact without needing to know the internal workings of one another. Integration, on the other hand, refers to the process of connecting these systems to work together effectively, often utilizing APIs to facilitate data exchange and process automation. By leveraging APIs in integrations, organizations can enhance operational efficiency, reduce data silos, and improve user experiences through seamless data flow between applications.\n\nVisit the following resources to learn more:\n\n- [@article@What is API Integration](https://www.ibm.com/topics/api-integration)\n- [@article@API Integration - Postman](https://www.postman.com/api-platform/api-integration/)\n- [@article@API First Integration](https://www.infoq.com/articles/api-first-integration/)",
    "application-architecture@Lqe47l4j-C4OwkbkwPYry": "# Application Level Architecture\n\nThe lowest level of architecture. Focus on one single application. Very detailed, low level design. Communication is usually within one development team.\n\nVisit the following resources to learn more:\n\n- [@article@Application Architecture](https://www.codesee.io/learning-center/application-architecture)",
    "architecture@OaLmlfkZid7hKqJ9G8oNV": "# Architectures\n\nArchitecture refers to the approach of designing and implementing software architecture with a focus on the tools and technologies that will be used during the development process. This perspective emphasizes that the selection of tools can significantly influence architectural decisions and the overall design of the system.",
    "atlassian-tools@3bpd0iZTd3G-H8A7yrExY": "# Atlassian Tools\n\nAtlassian tools offer a suite of solutions designed to streamline collaboration, project management, and incident handling for various teams. Jira serves as the core workflow engine, allowing organizations to track tasks through customizable workflows with granular permissions. Specialized tools like Jira Service Desk cater to help desk teams for managing incoming requests, while Jira Core enables business teams to organize and execute task-oriented projects across departments like marketing, HR, and operations. For enhanced collaboration, Confluence acts as a knowledge-sharing wiki, allowing teams to create, share, and audit content changes seamlessly. Bitbucket provides Git repository management for enterprise teams, fostering efficient collaboration on codebases.\n\nOther tools cater to more specific needs. **Statuspage** focuses on communication during outages or maintenance, keeping users informed from investigation to resolution. **Opsgenie** ensures smooth incident management for always-on services, helping dev and ops teams stay in control of alerts. **Advanced Roadmaps** for Jira assists multiple teams in capacity planning and dependency tracking, while **Jira Align** supports enterprise-level agile planning to align strategy with execution and drive digital transformation. Together, these tools empower teams to improve efficiency, transparency, and adaptability across various workflows.\n\nVisit the following resources to learn more:\n\n- [@official@Jira Service Desk](https://www.atlassian.com/software/jira/service-management/features/service-desk)\n- [@official@Jira Core](https://www.atlassian.com/software/jira/work-management)\n- [@official@Confluence](https://www.atlassian.com/wac/software/confluence?)\n- [@official@Bitbucket](https://bitbucket.org/product/)\n- [@official@Statuspage](https://www.atlassian.com/software/statuspage)\n- [@official@Opsgenie](https://www.atlassian.com/software/opsgenie)\n- [@official@Advanced Roadmaps for Jira](https://www.atlassian.com/software/jira/features/roadmaps)\n- [@official@Jira Align](https://www.atlassian.com/software/jira/align)\n- [@feed@Explore top posts about Atlassian](https://app.daily.dev/tags/atlassian?ref=roadmapsh)\n",
    "auth-strategies@KiwFXB6yd0go30zAFMTJt": "# Authentication Strategies\n\nAuthentication strategies are essential for ensuring secure access to applications and systems. They define how users are verified before being granted access to resources. Here are some common authentication strategies:\n\nPassword-Based Authentication\n\nMulti-Factor Authentication (MFA)\n\nOAuth and OpenID Connect\n\nToken-Based Authentication:\n\nBiometric Authentication\n\nCertificate-Based Authentication\n\nVisit the following resources to learn more:\n\n- [@article@JSON Web Token - Handbook](https://auth0.com/resources/ebooks/jwt-handbook)\n- [@article@Authentication vs Authorization](https://www.cerbos.dev/blog/authentication-vs-authorization)\n- [@video@SAML Overview](https://www.youtube.com/watch?v=i8wFExDSZv0)\n- [@video@A Developers Guide to SAML](https://www.youtube.com/watch?v=l-6QSEqDJPo)\n- [@video@SAML 2.0: Technical Overview](https://www.youtube.com/watch?v=SvppXbpv-5k)\n- [@video@An Illustrated Guide to OAuth and OpenID Connect](https://www.youtube.com/watch?v=t18YB3xDfXI)\n- [@video@OAuth 2.0 & OpenID Connect (OIDC): Technical Overview](https://www.youtube.com/watch?v=rTzlF-U9Y6Y)\n",
    "babok@LQlzVxUxM3haWRwbhYHKY": "# Babok\n\nThe guide to the Business Analysis Body of Knowledge (BABOK Guide) is a book from the International Institute of Business Analysis (IIBA) that provides business analysts (BAs) with strategies for using data to improve an organization's workflow processes, technology, products and services.\n\nVisit the following resources to learn more:\n\n- [@official@Babok](https://www.iiba.org/career-resources/a-business-analysis-professionals-foundation-for-success/babok/)\n- [@article@Wikipedia](https://en.wikipedia.org/wiki/A_Guide_to_the_Business_Analysis_Body_of_Knowledge)\n",
    "balance@otHQ6ye1xgkI1qb4tEHVF": "# Balance\n\nAchieving balance in architecture requires managing trade-offs between quality, cost, and development speed, avoiding over-engineering while aligning functional and non-functional requirements. Architects must navigate conflicting goals, like balancing short-term simplicity with long-term vision, ensuring solutions fit future needs while involving developers, businesses, and managers in understanding the financial and strategic impact. Additionally, architects often mediate between diverse groups, resolving conflicts and aligning strategies through effective communication, such as the “Four-Ears Model” by Schulze von Thun, which aids in fostering collaboration and achieving balanced, strategic outcomes.\n\nVisit the following resources to learn more:\n\n- [@article@Wikipedia](https://en.wikipedia.org/wiki/Balance_(architecture))",
    "bpm-bpel@DwNda95-fE7LWnDA6u1LU": "# BPM BPEL\n\n## BPM: Business Process Management\n\nMedium or large enterprises needs robust processes to streamline their business needs by reducing the cost incurred per process and diminishing the turn around time for each activity.\nTo achieve the above, there are various BPM tools like PEGA, IBM BPM, Appian, etc. Basically these tools automate the processes through a robust process modelling and implementation.\n\n## BPMN: Business Process Management Notations\n\nIts is a standard for representing business processes graphically. While modelling the process, the notations used are complied with BPMN (there are other like EPC, etc.). So BPMN is a standard notation that BPM consultants follow to model the business process. BPMN has versions and now BPMN 2.0 is the standard one.\n\n## BPEL : Business Process Execution Language\n\nProgrammers use BPEL to define how a business process that involves web services will be executed. BPEL messages are typically used to invoke remote services, orchestrate process execution and manage events and exceptions. BPEL is often associated with Business Process Management Notation. In many organizations, analysts use BPMN to visualize business processes and developers transform the visualizations to BPEL for execution.\n\nVisit the following resources to learn more:\n\n- [@article@What is BPM?](https://www.redhat.com/en/topics/automation/what-is-business-process-management)\n- [@article@BPEL described](https://www.ibm.com/docs/en/baw/19.x?topic=SS8JB4_19.x/com.ibm.wbpm.wid.main.doc/prodoverview/topics/cbpelproc.html)\n- [@video@BPM vs BPEL](https://www.youtube.com/watch?v=V6nr5dnb1JQ)\n",
    "ci--cd@isavRe4ANVn77ZX6gNSLH": "# CI / CD\n\nCI/CD is a method to frequently deliver apps to customers by introducing automation into the stages of app development. The main concepts attributed to CI/CD are continuous integration, continuous delivery, and continuous deployment. CI/CD is a solution to the problems integrating new code can cause for development and operations teams (AKA \"integration hell\").\n\nVisit the following resources to learn more:\n\n- [@article@CI/CID - GitHub](https://github.com/resources/articles/devops/ci-cd)\n- [@article@What is CI/CD? - Redhat](https://www.redhat.com/en/topics/devops/what-is-ci-cd)\n- [@article@Continuous Integration and Continuous Delivery Explained](https://www.infoworld.com/article/3271126/what-is-cicd-continuous-integration-and-continuous-delivery-explained.html)\n- [@feed@Explore top posts about CI/CD](https://app.daily.dev/tags/cicd?ref=roadmapsh)\n",
    "client--server@mka_DwiboH5sGFhXhk6ez": "# Client-Server Architecture\n\nClient-server architecture is a computing model that separates tasks or workloads between service providers (servers) and service requesters (clients). This architecture is widely used in networked applications, including web applications, where clients interact with servers to access resources, services, and data.\n\nVisit the following resources to learn more:\n\n- [@article@What is Client-Server Architecture](https://www.simplilearn.com/what-is-client-server-architecture-article)\n- [@feed@Explore top posts about Architecture](https://app.daily.dev/tags/architecture?ref=roadmapsh)\n",
    "cloud-design-patterns@CxceVdaNCyKDhs0huDtcL": "# Cloud Design Patterns\n\nThese design patterns are useful for building reliable, scalable, secure applications in the cloud. The cloud design patterns where each pattern describes the problem that the pattern addresses, considerations for applying the pattern, and an example based on Microsoft Azure. Most patterns include code samples or snippets that show how to implement the pattern on Azure. However, most patterns are relevant to any distributed system, whether hosted on Azure or other cloud platforms.\n\nVisit the following resources to learn more:\n\n- [@article@Cloud Design Patterns](https://learn.microsoft.com/en-us/azure/architecture/patterns/)\n- [@feed@Explore top posts about Cloud](https://app.daily.dev/tags/cloud?ref=roadmapsh)\n",
    "cloud-providers@C0rKd5Rr27Z1_GleoEZxF": "# Cloud Providers\n\nCloud providers provide a layer of APIs to abstract infrastructure and provision it based on security and billing boundaries. The cloud runs on servers in data centers, but the abstractions cleverly give the appearance of interacting with a single “platform” or large application. The ability to quickly provision, configure, and secure resources with cloud providers has been key to both the tremendous success and complexity of modern DevOps.\n\nVisit the following resources to learn more:\n\n- [@article@Cloud Service Provider](https://www.techtarget.com/searchitchannel/definition/cloud-service-provider-cloud-provider)\n- [@article@What are Cloud Providers?](https://www.redhat.com/en/topics/cloud-computing/what-are-cloud-providers)\n- [@feed@Explore top posts about Cloud](https://app.daily.dev/tags/cloud?ref=roadmapsh)",
    "communication@Ac49sOlQKblYK4FZuFHDR": "# Communication\n\nFrom my observations this is one of the most underestimated skill. If you are brilliant in design but cannot communicate your ideas, your thoughts are likely to have less impact or even fail to succeed.\n\nCommunication is a critical yet often underestimated skill, especially for architects. It involves clearly conveying ideas, structuring discussions effectively, and driving meetings. Tools like “UZMO — Thinking With Your Pen” can enhance visual communication skills. Public speaking, whether to small or large groups, requires practice and stepping out of one’s comfort zone. Tailoring communication to the audience is essential—developers focus on details, while managers prioritize cost and outcomes. Regular, transparent communication ensures alignment across all levels, making the rationale behind decisions clear. Always being prepared with key slides and answers can boost confidence and efficiency during interactions.\n\nVisit the following resources to learn more:\n\n- [@article@Communication Skills](https://en.wikipedia.org/wiki/Communication)",
    "consult--coach@LSWlk9A3b6hco9Il_elao": "# Consult and Coach\n\nProactive consulting and coaching are essential to prevent architectural issues from escalating. Architects must anticipate future needs and prepare the organization by setting a clear vision of mid- and long-term goals, often using maturity models to provide structure and measure progress against SMART criteria. Building a **Community of Practice (CoP)** fosters collaboration, standardization, and knowledge sharing among professionals with shared interests, such as developers and architects, enhancing individual and organizational growth. Open-door sessions, held regularly without a strict agenda, encourage open communication, resolve minor issues promptly, and address complex topics through follow-ups, reducing misconceptions and ambiguity.\n\nVisit the following resources to learn more:\n\n- [@article@Wikipedia](https://en.wikipedia.org/wiki/Consulting)",
    "containers@l3oeo65FyV5HHvw5n_1wa": "# Containers\n\nContainers are a construct in which cgroups, namespaces, and chroot are used to fully encapsulate and isolate a process. This encapsulated process, called a container image, shares the kernel of the host with other containers, allowing containers to be significantly smaller and faster than virtual machines. These images are designed for portability, allowing for full local testing of a static image, and easy deployment to a container management platform.\n\nVisit the following resources to learn more:\n\n- [@article@cgroups](https://en.wikipedia.org/wiki/Cgroups)\n- [@article@namespaces](https://en.wikipedia.org/wiki/Linux_namespaces)\n- [@article@chroot](https://en.wikipedia.org/wiki/Chroot)\n- [@article@What are Containers?](https://cloud.google.com/learn/what-are-containers)\n- [@article@What is a Container?](https://www.docker.com/resources/what-container/)\n- [@video@What are Containers?](https://www.youtube.com/playlist?list=PLawsLZMfND4nz-WDBZIj8-nbzGFD4S9oz)\n- [@article@Articles about Containers - The New Stack](https://thenewstack.io/category/containers/)\n- [@feed@Explore top posts about Containers](https://app.daily.dev/tags/containers?ref=roadmapsh)\n",
    "cqrs-eventual-consistency@RsnN5bt8OhSMjSFmVgw-X": "# CQRS eventual consistency\n\nCQRS (Segregation of Responsibility for Command Queries) is an architecture pattern that comes with the idea of separating read and write operations into two distinct logical processes.\n\nVisit the following resources to learn more:\n\n- [@article@CQRS](https://martinfowler.com/bliki/CQRS.html)\n- [@article@Introduction to CQRS](https://learn.microsoft.com/en-us/azure/architecture/patterns/cqrs)\n",
    "datawarehouse-principles@B5YtP8C1A0jB3MOdg0c_q": "# Datawarehouses Principles\n\nIt is based on the assumption that every system should take care of a concern in a way that such concern should be encapsulated by the system itself.\n\nVisit the following resources to learn more:\n\n- [@article@Toptal Developers Website](https://www.toptal.com/data-science/data-warehouse-concepts-principles)\n",
    "ddd@IIelzs8XYMPnXabFKRI51": "# Domain-Driven Design\n\nDomain-driven design (DDD) is a software design approach focusing on modeling software to match a domain according to input from that domain's experts.\n\nIn terms of object-oriented programming, it means that the structure and language of software code (class names, class methods, class variables) should match the business domain. For example, if a software processes loan applications, it might have classes like LoanApplication and Customer, and methods such as AcceptOffer and Withdraw.\n\nDDD connects the implementation to an evolving model and it is predicated on the following goals:\n\n- Placing the project's primary focus on the core domain and domain logic;\n- Basing complex designs on a model of the domain;\n- Initiating a creative collaboration between technical and domain experts to iteratively refine a conceptual model that addresses particular domain problems.\n\nVisit the following resources to learn more:\n\n- [@article@DDD Starter Modelling Process](https://github.com/ddd-crew/ddd-starter-modelling-process/)\n- [@article@Domain Driven Design Quickly](https://web.archive.org/web/20230606035225/https://matfrs2.github.io/RS2/predavanja/literatura/Avram%20A,%20Marinescu%20F.%20-%20Domain%20Driven%20Design%20Quickly.pdf)\n- [@feed@Explore top posts about Architecture](https://app.daily.dev/tags/architecture?ref=roadmapsh)\n",
    "decision-making@MSDo0nPk_ghRYkZS4MAQ_": "# Decision Making\n\nEffective decision-making is crucial for architects to guide projects and organizations in the right direction. Focus on what’s important by emphasizing **conceptual integrity** (sticking to consistent decisions for simplicity and maintainability) and **uniformity** (ensuring standards like naming conventions are applied consistently). Prioritize critical decisions early to avoid costly workarounds or project delays, using tools like the Weighted Shortest Job First (WSJF) model for prioritization. Stay within your scope of competence to maintain credibility, collaborate with peers, and clarify responsibilities within the architectural hierarchy.\n\nWhen making decisions, evaluate multiple options to ensure thorough analysis and foster stakeholder confidence. Comparing options based on measurable criteria, such as cost or feasibility, leads to better, fact-driven decisions. This process not only supports sustainable outcomes but also prepares you with strong arguments during discussions, ensuring alignment across teams and stakeholders.\n\nVisit the following resources to learn more:\n\n- [@article@Decision Making - Wikipedia](https://en.wikipedia.org/wiki/Decision-making)\n",
    "design--architecture@fBd2m8tMJmhuNSaakrpg4": "# Design and Architecture\n\nGood design in software architecture blends theoretical knowledge with practical experience. Theoretically, architects should master fundamental design patterns, such as those detailed in *\"Design Patterns: Elements of Reusable Object-Oriented Software\"*, which remain foundational for modern architecture. Advanced knowledge of patterns and anti-patterns, like those in *\"Enterprise Integration Patterns\"*, extends this understanding. Architects must also focus on quality measures, ensuring designs meet non-functional requirements like scalability, security, and adaptability.  \n\nPractically, architects improve by experimenting with various technology stacks, gaining insights into their strengths and limitations. Exploring frameworks like Angular reveals real-world pattern applications, such as Observables, and fosters deeper understanding through hands-on coding. Attending user groups and engaging in communities, like those on Meetup, broadens perspectives and encourages curiosity, enabling architects to stay updated and continuously refine their craft.\n\nVisit the following resources to learn more:\n\n- [@roadmap@Visit Dedicated Software Design Roadmap](https://roadmap.sh/software-design-architecture)\n- [@opensource@Design Patterns for Humans](https://github.com/kamranahmedse/design-patterns-for-humans)\n",
    "distributed-systems@j7OP6RD_IAU6HsyiGaynx": "# Distributed Systems\n\nDistributed systems are a type of computing architecture where components located on networked computers communicate and coordinate their actions by passing messages. These systems are designed to work together to achieve a common goal, often providing services or processing data in a collaborative manner.\n\nVisit the following resources to learn more:\n\n- [@article@Free Distributed Systems book from Maarten van Steen](https://www.distributed-systems.net/index.php/books/ds3/)\n- [@article@Distributed Architectures](https://estuary.dev/distributed-architecture/)\n- [@feed@Explore top posts about Architecture](https://app.daily.dev/tags/architecture?ref=roadmapsh)\n",
    "documentation@5D-kbQ520k1D3fCtD01T7": "# Documentation\n\nArchitectural documentation is sometimes more and sometimes less important. Important documents are for example architectural decisions or code guidelines. Initial documentation is often required before coding starts and need to be refined continuously. Other documentation can be automatically generated as code can also be documentation, e.g. UML class diagrams.\n\nVisit the following resources to learn more:\n\n- [@article@Wikipedia](https://en.wikipedia.org/wiki/Documentation)\n- [@article@The Ultimate Guide To Software Architecture Documentation](https://www.workingsoftware.dev/software-architecture-documentation-the-ultimate-guide/)",
    "emc-dms@YfYviOXqGVp9C6DuhqBrn": "# EMC and DMS\n\nEMC (Enterprise Metadata Catalog) and DMS (Document Management System) are two distinct concepts in the realm of data management and information systems. Below is an overview of each:\n\nAn Enterprise Metadata Catalog (EMC) is a centralized repository that stores metadata about data assets within an organization. This metadata provides context, meaning, and structure to the data, enabling better data management and utilization.\n\nA Document Management System (DMS) is a software solution that helps organizations capture, store, manage, and track electronic documents and images of paper-based information. DMS solutions are essential for organizing and securing documents in a digital format.\n\nVisit the following resources to learn more:\n\n- [@article@DMS](https://www.opentext.com/products/documentum-content-management)\n- [@article@EMC Softwares](https://www.spiceworks.com/collaboration/content-collaboration/articles/top-10-enterprise-content-management-software-systems/)",
    "enterprise-architecture@vlW07sc-FQnxPMjDMn8_F": "# Enterprise Level Architecture\n\nThe highest level of architecture. Focus on multiple solutions. High level, abstract design, which needs to be detailed out by solution or application architects. Communication is across the organization.\n\nVisit the following resources to learn more:\n\n- [@article@Enterprise Software Architecture](https://medium.com/@hsienwei/enterprise-software-architecture-957288829daa)\n- [@article@Enterprise Architect vs Software Architect](https://www.linkedin.com/pulse/enterprise-architect-vs-software-who-you-luigi-saggese/)\n- [@feed@Explore top posts about Architecture](https://app.daily.dev/tags/architecture?ref=roadmapsh)\n",
    "enterprise-software@8yALyPVUZPtd7LX3GrO1e": "# Enterprise Software\n\nEnterprise software refers to software applications that are designed to meet the needs of large organizations or enterprises. These applications are typically complex, scalable, and capable of integrating with other systems to support a wide range of business functions. Enterprise software is used to improve efficiency, streamline processes, and enhance productivity across various departments within an organization.\n\nVisit the following resources to learn more:\n\n- [@article@Enterprise Softwares](https://en.wikipedia.org/wiki/Enterprise_software)",
    "esb-soap@fELnBA0eOoE-d9rSmDJ8l": "# ESB and SOAP\n\nESB (Enterprise Service Bus) and SOAP (Simple Object Access Protocol) are two technologies that enable communication between different systems. ESB is a software architecture that allows for the integration of various systems, such as databases, web services, and mobile applications. SOAP is a messaging protocol that enables the exchange of structured data between systems over the internet.\n\nVisit the following resources to learn more:\n\n- [@article@Understanding SOAP: The Old Guard of Web Services](https://mariomthree.medium.com/understanding-soap-the-old-guard-of-web-services-6ca89d8ec312)\n- [@article@Enterprise Service Bus](https://en.wikipedia.org/wiki/Enterprise_service_bus)\n- [@article@ESB - IBM](https://www.ibm.com/topics/esb)",
    "estimate-and-evaluate@m0ZYdqPFDoHOPo18wKyvV": "# Estimate and Evaluate\n\nEstimation and evaluation are critical skills for architects and lead developers. Architects must understand basic project management principles to provide estimates for timelines, resources, and costs, considering all project phases like requirements, testing, and debugging. Using past data or models like COCOMO helps refine estimates. For agile projects, resources like *\"Agile Estimating and Planning\"* by Mike Cohn can offer valuable guidance. \n\nEvaluating \"unknown\" architectures involves assessing their suitability for current and future contexts through prepared questions. These should cover design practices (e.g., patterns and structure), development practices (e.g., code guidelines and deployment), quality assurance (e.g., test automation and peer reviews), and security measures (e.g., built-in security and penetration tests). This structured approach ensures informed decisions and promotes robust, maintainable solutions.\n\nVisit the following resources to learn more:\n\n- [@article@Evaluating Software Architectures](https://medium.com/oolooroo/evaluating-digital-architectures-a-deep-dive-into-modern-software-systems-analysis-dff3b0d2da8f)\n- [@article@How to Evaluate Software Architecture: Methods and Tools](https://www.linkedin.com/advice/0/what-most-common-software-architecture-evaluation)",
    "etl-datawarehouses@JUFE4OQhnXOt1J_MG-Sjf": "# ETL Datawarehouses\n\nETL (Extract, Transform, Load) is a key process in data warehousing, enabling the integration of data from multiple sources into a centralized database. The process begins by **extracting** data from original sources, followed by **transforming** it to ensure quality, deduplication, and combination, and finally **loading** it into the target database. ETL tools streamline this process, allowing companies to consolidate diverse data types and ensure seamless integration for effective data analysis and decision-making.\n\nVisit the following resources to learn more:\n\n- [@article@What is ETL?](https://www.snowflake.com/guides/what-etl)\n- [@video@ETL Explained](https://www.youtube.com/watch?v=OW5OgsLpDCQ)\n- [@feed@Explore top posts about ETL](https://app.daily.dev/tags/etl?ref=roadmapsh)\n",
    "firewalls@Hqk_GGsFi14SI5fgPSoGV": "# Firewalls\n\nA Firewall is a network security device that monitors and filters incoming and outgoing network traffic based on an organization's previously established security policies. Firewalls usually sit between a trusted network and an untrusted network; oftentimes the untrusted network is the Internet. For example, office networks often use a firewall to protect their network from online threats.\n\nVisit the following resources to learn more:\n\n- [@article@What is a Firewall? - Cloudflare](https://www.cloudflare.com/learning/security/what-is-a-firewall/)\n- [@article@Firewall - Cisco](https://www.cisco.com/site/us/en/learn/topics/security/what-is-a-firewall.html)\n",
    "frameworks@hjlkxYZS7Zf9En3IUS-Wm": "# Architect Frameworks\n\nArchitect frameworks are tools that provide a structured approach to software architecture. They help architects organize their work, manage dependencies, and ensure consistency across projects. Some popular frameworks include:\n\nVisit the following resources to learn more:\n\n- [@article@Architect Frameworks](https://www.techtarget.com/searchapparchitecture/definition/enterprise-architecture-framework)\n- [@article@Common Software Architecture Frameworks](https://medium.com/@publicapplicationcenter/tutorial-notes-common-software-architecture-frameworks-1a9915e1d806)\n",
    "functional-programming@6FDGecsHbqY-cm32yTZJa": "# Functional Programming\n\nFunctional programming is a programming paradigm designed to handle pure mathematical functions. This paradigm is totally focused on writing more compounded and pure functions.\n\nVisit the following resources to learn more:\n\n- [@article@Functional Programming](https://en.wikipedia.org/wiki/Functional_programming)\n- [@video@Learning Functional Programming](https://youtube.com/watch?v=e-5obm1G_FY)\n- [@article@Functional Programming with JavaScript](https://www.telerik.com/blogs/functional-programming-javascript)",
    "git@ZEzYb-i55hBe9kK3bla94": "# Git\n\nGit is a distributed version control system designed to handle projects of any size with speed and efficiency. Created by Linus Torvalds in 2005, Git tracks changes in source code during software development, allowing multiple developers to work together on non-linear development. It provides strong support for branching, merging, and distributed development workflows. Git maintains a complete history of all changes, enabling easy rollbacks and comparisons between versions. Its distributed nature means each developer has a full copy of the repository, allowing for offline work and backup. Git's speed, flexibility, and robust branching and merging capabilities have made it the most widely used version control system in software development, particularly for open-source projects.\n\nVisit the following resources to learn more:\n\n- [@roadmap@Visit Dedicated Git & GitHub Roadmap](https://roadmap.sh/git-github)\n- [@video@Git & GitHub Crash Course For Beginners](https://www.youtube.com/watch?v=SWYqp7iY_Tc)\n- [@article@Git Cheat Sheet](https://cs.fyi/guide/git-cheatsheet)\n- [@article@Tutorial: Git for Absolutely Everyone](https://thenewstack.io/tutorial-git-for-absolutely-everyone/)\n- [@feed@Explore top posts about Git](https://app.daily.dev/tags/git?ref=roadmapsh)\n",
    "github@PyTuVs08_z4EhLwhTYzFu": "# GitHub\n\nGitHub has become a central hub for open-source projects and is widely used by developers, companies, and organizations for both private and public repositories. It was acquired by Microsoft in 2018 but continues to operate as a relatively independent entity. GitHub's popularity has made it an essential tool in modern software development workflows and a key platform for showcasing coding projects and contributing to open-source software.\n\nVisit the following resources to learn more:\n\n- [@roadmap@Visit Dedicated Git & GitHub Roadmap](https://roadmap.sh/git-github)\n- [@official@GitHub](https://github.com)\n- [@official@GitHub: Quickstart](https://docs.github.com/en/get-started/quickstart/hello-world)\n- [@official@GitHub Documentation](https://docs.github.com/en/get-started/quickstart)\n- [@official@Learn GitHub by doing](https://skills.github.com/)\n- [@video@What is GitHub?](https://www.youtube.com/watch?v=w3jLJU7DT5E)\n- [@feed@Explore top posts about GitHub](https://app.daily.dev/tags/github?ref=roadmapsh)\n",
    "go@nKlM9k4qAh4wBFXqM-2kC": "# Go\n\nGo is an open source programming language supported by Google. Go can be used to write cloud services, CLI tools, used for API development, and much more.\n\nVisit the following resources to learn more:\n\n- [@roadmap@Visit Dedicated Go Roadmap](https://roadmap.sh/golang)\n- [@official@A Tour of Go – Go Basics](https://go.dev/tour/welcome/1)\n- [@official@Go Reference Documentation](https://go.dev/doc/)\n- [@article@Go by Example - annotated example programs](https://gobyexample.com/)\n- [@feed@Explore top posts about Golang](https://app.daily.dev/tags/golang?ref=roadmapsh)\n",
    "graphql@Sp3FdPT4F9YnTGvlE_vyq": "# Graphql\n\nGraphQL is a query language and runtime for APIs, developed by Facebook. GraphQL's flexibility and efficiency make it popular for building complex applications, especially those with diverse client requirements. It's particularly useful for mobile applications where bandwidth efficiency is crucial. While it requires a paradigm shift from REST, many developers and organizations find GraphQL's benefits outweigh the learning curve, especially for large-scale or rapidly evolving APIs.\n\nVisit the following resources to learn more:\n\n- [@roadmap@visit Dedicated GraphQL Roadmap](https://roadmap.sh/graphql)\n- [@official@Introduction to GraphQL](https://graphql.org/learn/)\n- [@video@GraphQL Course for Beginners](https://www.youtube.com/watch?v=ed8SzALpx1Q)\n- [@article@Introduction to GraphQL](https://thenewstack.io/introduction-to-graphql/)\n- [@article@How to Execute a Simple GraphQL Query](https://thenewstack.io/how-to-execute-a-simple-graphql-query/)\n- [@feed@Explore top posts about GraphQL](https://app.daily.dev/tags/graphql?ref=roadmapsh)",
    "grpc@priDGksAvJ05YzakkTFtM": "# gRPC\n\ngRPC is a platform agnostic serialization protocol that is used to communicate between services. Designed by Google in 2015, it is a modern alternative to REST APIs. It is a binary protocol that uses HTTP/2 as a transport layer. It is a high performance, open source, general-purpose RPC framework that puts mobile and HTTP/2 first.\n\nIt's main use case is for communication between two different languages within the same application. You can use Python to communicate with Go, or Java to communicate with C#.\ngRPC uses the protocol buffer language to define the structure of the data that is\n\nVisit the following resources to learn more:\n\n- [@official@gRPC Website](https://grpc.io/)\n- [@official@gRPC Introduction](https://grpc.io/docs/what-is-grpc/introduction/)\n- [@official@gRPC Core Concepts](https://grpc.io/docs/what-is-grpc/core-concepts/)\n- [@video@Stephane Maarek - gRPC Introduction](https://youtu.be/XRXTsQwyZSU)\n- [@feed@Explore top posts about gRPC](https://app.daily.dev/tags/grpc?ref=roadmapsh)\n",
    "hadoop-spark-mapreduce@92GG4IRZ3FijumC94aL-T": "# Spark, Hadoop MapReduce\n\nSpark is a data processing framework that can quickly perform processing tasks on very large data sets, and can also distribute data processing tasks across multiple computers, either on its own or in tandem with other distributed computing tools.\n\nHadoop MapReduce is a software framework for easily writing applications which process vast amounts of data (multi-terabyte data-sets) in-parallel on large clusters (thousands of nodes) of commodity hardware in a reliable, fault-tolerant manner.\n\nVisit the following resources to learn more:\n\n- [@official@Apache Spark](https://spark.apache.org/)\n- [@article@Spark vs Hadoop MapReduce](https://www.integrate.io/blog/apache-spark-vs-hadoop-mapreduce)\n- [@video@Hadoop explained in 5 minutes](https://www.youtube.com/watch?v=aReuLtY0YMI)\n- [@feed@Explore top posts about Apache Spark](https://app.daily.dev/tags/spark?ref=roadmapsh)\n",
    "hadoop@I_VjjmMK52_tS8qjQUspN": "# Hadoop\n\nThe Apache Hadoop software library is a framework that allows for the distributed processing of large data sets across clusters of computers using simple programming models.\n\nVisit the following resources to learn more:\n\n- [@official@Apache Hadoop](https://hadoop.apache.org/)\n- [@article@Apache Hadoop - Wikipedia](https://en.wikipedia.org/wiki/Apache_Hadoop)\n- [@feed@Explore top posts about Apache Hadoop](https://app.daily.dev/tags/apache-hadoop?ref=roadmapsh)\n",
    "hashing-algorithms@7tBAD0ox9hTK4D483GTRo": "# Hashing Algorithms\n\nHashing algorithms are used to generate a unique value for a given input. This value is called a hash. Hashing algorithms are used to verify the integrity of data, to store passwords, and to generate unique identifiers for data.\n\nVisit the following resources to learn more:\n\n- [@article@What is Hashing?](https://www.codecademy.com/resources/blog/what-is-hashing/)\n- [@video@Hashing Algorithms and Security - Computerphile](https://www.youtube.com/watch?v=b4b8ktEV4Bg)\n- [@video@Top Hashing Algorithms In Cryptography | MD5 and SHA 256 Algorithms Expalined | Simplilearn](https://www.youtube.com/watch?v=Plp4F3ZfC7A)\n- [@video@SHA: Secure Hashing Algorithm - Computerphile](https://www.youtube.com/watch?v=DMtFhACPnTY)\n- [@feed@Explore top posts about Algorithms](https://app.daily.dev/tags/algorithms?ref=roadmapsh)\n",
    "how-to-code@77KvWCA1oHSGgDKBTwjv7": "# How to Code\n\nEven as an Enterprise Architect, staying connected to coding practices is essential to understand developers’ challenges and earn their trust. Maintaining a **side project** allows you to explore new technologies, tools, and methodologies hands-on, building practical experience beyond theoretical knowledge. This helps in forming informed decisions and keeping pace with evolving trends in development. \n\nTo prioritize what to explore, structured resources like ThoughtWorks’ Technology Radar can guide you. It categorizes technologies into **Adopt**, **Trial**, **Assess**, and **Hold**, helping architects focus on impactful and enterprise-ready innovations. Staying informed and involved ensures better collaboration and alignment with developers.\n\nVisit the following resources to learn more:\n\n- [@article@How to Code](https://www.thoughtworks.com/insights/blog/how-to-code)\n- [@article@Technology Radar](https://www.thoughtworks.com/radar)",
    "http-https@Nq6o6Ty8VyNRsvg-UWp7D": "# Http Https\n\nHTTP is the `TCP/IP` based application layer communication protocol which standardizes how the client and server communicate with each other. It defines how the content is requested and transmitted across the internet.\n\nHTTPS (Hypertext Transfer Protocol Secure) is the secure version of HTTP, which is the primary protocol used to send data between a web browser and a website.\n\n`HTTPS = HTTP + SSL/TLS`\n\nVisit the following resources to learn more:\n\n- [@article@What is HTTPS?](https://www.cloudflare.com/en-gb/learning/ssl/what-is-https/)\n- [@article@What is HTTP?](https://www.cloudflare.com/en-gb/learning/ddos/glossary/hypertext-transfer-protocol-http/)\n- [@article@Overview of HTTP](https://developer.mozilla.org/en-US/docs/Web/HTTP/Overview)\n- [@article@Everything you need to know about HTTP](https://cs.fyi/guide/http-in-depth)\n- [@article@HTTP/3 From A To Z: Core Concepts](https://www.smashingmagazine.com/2021/08/http3-core-concepts-part1/)\n- [@article@Why HTTPS Matters](https://developers.google.com/web/fundamentals/security/encrypt-in-transit/why-https)\n- [@article@Enabling HTTPS on Your Servers](https://developers.google.com/web/fundamentals/security/encrypt-in-transit/enable-https)\n- [@video@HTTP Crash Course & Exploration](https://www.youtube.com/watch?v=iYM2zFP3Zn0)\n",
    "iaf@wFu9VO48EYbIQrsM8YUCj": "# Iaf\n\nThe Integrated Architecture Framework (IAF) is an enterprise architecture framework that covers business, information, information system and technology infrastructure.\n\nVisit the following resources to learn more:\n\n- [@article@Wikipedia](https://en.wikipedia.org/wiki/Integrated_Architecture_Framework)\n- [@article@IAF PDF](https://www.capgemini.com/wp-content/uploads/2018/03/architecture-for-the-information-age.pdf)\n",
    "ibm-bpm@5EVecZmvor09LjD7WR_Y9": "# IBM BPM\n\nIBM BPM is a comprehensive business process management platform. It provides a robust set of tools to author, test, and deploy business processes, as well as full visibility and insight to managing those business processes.\n\nVisit the following resources to learn more:\n\n- [@official@Overview BPM](https://www.ibm.com/docs/en/bpm/8.5.5?topic=manager-business-process-overview)\n- [@video@BPM Demo](https://www.youtube.com/watch?v=6yn4nCWMNLI)\n- [@feed@Explore top posts about IBM](https://app.daily.dev/tags/ibm?ref=roadmapsh)\n",
    "important-skills-to-learn@lBtlDFPEQvQ_xtLtehU0S": "# Important Skills\n\nTo support the laid-out activities specific skills are required. From my experience, read books and discussions we can boil this down to these ten skills every software architect should have:\n\n- Design\n- Decide\n- Simplify\n- Code\n- Document\n- Communicate\n- Estimate\n- Balance\n- Consult\n- Market\n",
    "infrastructure-as-code@igf9yp1lRdAlN5gyQ8HHC": "# Infrastructure as Code\n\nSometimes referred to as IaC, this section refers to the techniques and tools used to define infrastructure, typically in a markup language like YAML or JSON. Infrastructure as code allows DevOps Engineers to use the same workflows used by software developers to version, roll back, and otherwise manage changes.\n\nThe term Infrastructure as Code encompasses everything from bootstrapping to configuration to orchestration, and it is considered a best practice in the industry to manage all infrastructure as code. This technique precipitated the explosion in system complexity seen in modern DevOps organizations.\n\nVisit the following resources to learn more:\n\n- [@article@What is Infrastructure as Code](https://www.redhat.com/en/topics/automation/what-is-infrastructure-as-code-iac)\n- [@article@GUIs, CLI, APIs: Learn Basic Terms of Infrastructure-as-Code](https://thenewstack.io/guis-cli-apis-learn-basic-terms-of-infrastructure-as-code/)\n- [@video@What is Infrastructure as Code?](https://www.youtube.com/watch?v=zWw2wuiKd5o)\n- [@video@What is Infrastructure as Code? Difference of Infrastructure as Code Tools](https://www.youtube.com/watch?v=POPP2WTJ8es)\n- [@video@Introduction to Infrastructure as Code](https://www.youtube.com/watch?v=zWw2wuiKd5o)\n- [@feed@Explore top posts about Infrastructure](https://app.daily.dev/tags/infrastructure?ref=roadmapsh)\n",
    "itil@Rq1Wi-cHjS54SYo-Btp-e": "# ITIL\n\n**ITIL (Information Technology Infrastructure Library)** is a set of best practices for IT service management, designed to align IT services with business needs. Its primary focus is the efficient and effective delivery of value through managing the IT service lifecycle, which includes five phases: `Strategy`, `Design`, `Transition`, `Operation`, and `Continual Service Improvement`. ITIL includes key processes such as incident management, problem management, change management, configuration management, and service level agreements (SLAs). These practices aim to optimize performance, service quality, and customer satisfaction. Adopting ITIL helps organizations improve operational efficiency, reduce risks, and maintain clear control over IT services over time.\n\nVisit the following resources to learn more:\n\n- [@official@ITIL Documentation](https://www.axelos.com/certifications/itil-service-management/itil-4-foundation)\n- [@video@What is ITIL?](https://www.youtube.com/watch?v=wgnpfMK8vDk)\n",
    "java--kotlin--scala@a5DB_hsD4bAf8BtHNFNPo": "# Java/Kotlin/Scala\n\n- **Java**: Java is a widely-used, object-oriented programming language known for its platform independence, reliability, and scalability. It’s commonly used for building large-scale enterprise applications, Android development, and web services. Java’s extensive libraries, frameworks, and strong community support make it a popular choice for developers.\n\n- **Scala**: Scala is a statically-typed programming language that combines object-oriented and functional programming paradigms. It runs on the Java Virtual Machine (JVM) and is known for its concise syntax, expressive power, and compatibility with Java. Scala is often used in data engineering, backend services, and applications requiring high concurrency.\n\n- **Kotlin**: Kotlin is a modern, statically-typed programming language designed to be fully interoperable with Java while offering more concise and expressive syntax. It is particularly popular for Android development due to its simplicity and safety features, such as null safety, and is gaining traction in backend development as well.\n\nVisit the following resources to learn more:\n\n- [@roadmap@Visit Dedicated Java Roadmap](https://roadmap.sh/java)\n- [@official@Scala](https://www.scala-lang.org/)\n- [@official@Scala Documentation](https://docs.scala-lang.org/)\n- [@official@Kotlin](https://kotlinlang.org/)\n- [@official@Kotlin Documentation](https://kotlinlang.org/docs/home.html)\n- [@official@Java](https://www.java.com/)\n- [@feed@Explore top posts about Java](https://app.daily.dev/tags/java?ref=roadmapsh)\n",
    "javascript--typescript@bhP5gMpRVebSFpCeHVXBj": "# JavaScript\n\nJavaScript allows you to add interactivity to your pages. Common examples that you may have seen on the websites are sliders, click interactions, popups and so on. Apart from being used on the frontend in browsers, there is Node.js which is an open-source, cross-platform, back-end JavaScript runtime environment that runs on the V8 engine and executes JavaScript code outside a web browser. TypeScript adds optional types to JavaScript that support tools for large-scale JavaScript applications for any browser, for any host, on any OS. TypeScript compiles to readable, standards-based JavaScript.\n\nVisit the following resources to learn more:\n\n- [@roadmap@Visit Dedicated JavaScript Roadmap](https://roadmap.sh/javascript)\n- [@roadmap@Visit Dedicated TypedScript Roadmap](https://roadmap.sh/typescript)\n- [@official@TypeScript](https://www.typescriptlang.org/)\n- [@official@TypeScript Docs for Deep Dives](https://www.typescriptlang.org/docs/)\n- [@article@The Modern JavaScript Tutorial](https://javascript.info/)\n- [@video@JavaScript Crash Course for Beginners](https://youtu.be/hdI2bqOjy3c)\n- [@video@Node.js Crash Course](https://www.youtube.com/watch?v=fBNz5xF-Kx4)\n- [@video@Node.js Tutorial for Beginners](https://www.youtube.com/watch?v=TlB_eWDSMt4)\n- [@video@TypeScript for Beginners](https://www.youtube.com/watch?v=BwuLxPH8IDs)\n- [@feed@Explore top posts about JavaScript](https://app.daily.dev/tags/javascript?ref=roadmapsh)\n",
    "kanban@O7H6dt3Z7EKohxfJzwbPM": "# Kanban\r\n\r\n`Kanban` is a popular agile methodology that focuses on visualizing workflow and continuously improving that flow. It's a more flexible approach than Scrum, without the rigid framework.\r\n\r\nVisit the following resources to learn more:\r\n\r\n- [@article@What Is Kanban? A Simple Guide to Improve Efficiency.](https://businessmap.io/kanban-resources/getting-started/what-is-kanban)\r\n- [@article@Kanban Methodology: The Simplest Agile Framework ](https://kissflow.com/project/agile/kanban-methodology/)\r\n- [@article@What is Kanban Methodology? The Ultimate Guide](https://www.wrike.com/kanban-guide/what-is-kanban/)",
    "layered@05hLO2_A8Tr6cLJGFRhOh": "# Layered Architecture\n\nLayered architecture is a software design pattern where an application is divided into distinct layers, each with a specific responsibility, such as presentation, business logic, and data access. This approach promotes modularity, easier maintenance, testing, and component reusability. The most common implementation is the three-tier architecture, which separates concerns between the user interface, business rules, and data handling. However, it can introduce complexity, performance issues, tight coupling, and overhead if not carefully implemented. Despite these challenges, layered architecture is widely used in scalable and maintainable systems, particularly in enterprise applications.\n\nVisit the following resources to learn more:\n\n- [@article@Wikipedia](https://en.wikipedia.org/wiki/Layered_architecture)\n",
    "less@qwpsGRFgzAYstM7bJA2ZJ": "# Less\n\n**LeSS** (Large-Scale-Scrum) is an agile framework designed to scale Scrum across multiple teams working on a single product. It adheres to Scrum's principles, emphasizing simplicity and continuous improvement. LeSS encourages coordination between teams by using a single backlog and a common Product Owner. Each team is responsible for parts of the product, but they collaborate in its joint development, with frequent feedback loops to adjust project direction. Its goal is to minimize bureaucracy and maximize value delivery in an agile and efficient way.\n\nVisit the following resources to learn more:\n\n- [@official@LeSS Framework](https://less.works/less/framework)\n- [@video@Introduction to LeSS](https://www.youtube.com/watch?v=1BZf_Oa7W94)\n",
    "levels-of-architecture@2sR4KULvAUUoOtopvsEBs": "# Levels of Architecture\n\nArchitecture can be done on several “levels” of abstractions. The level influences the importance of necessary skills. As there are many categorizations possible my favorite segmentation includes these 3 levels:\n\n- **Application Level:** The lowest level of architecture. Focus on one single application. Very detailed, low level design. Communication is usually within one development team.\n- **Solution Level:** The mid-level of architecture. Focus on one or more applications which fulfill a business need (business solution). Some high, but mainly low-level design. Communication is between multiple development teams.\n- **Enterprise Level:** The highest level of architecture. Focus on multiple solutions. High level, abstract design, which needs to be detailed out by solution or application architects. Communication is across the organization.\n",
    "linux--unix@XnvlRrOhdoMsiGwGEhBro": "# Linux / Unix\n\nKnowledge of UNIX is a must for almost all kind of development as most of the codes that you write is most likely going to be finally deployed on a UNIX/Linux machine. Linux has been the backbone of the free and open source software movement, providing a simple and elegant operating system for almost all your needs.\n\nVisit the following resources to learn more:\n\n- [@roadmap@Visit Dedicated Linux Roadmap](https://roadmap.sh/linux)\n- [@video@Linux Operating System - Crash Course](https://www.youtube.com/watch?v=ROjZy1WbCIA)\n- [@article@Unix & Linux Tutorial](https://www.tutorialspoint.com/unix/index.htm)\n- [@article@Linux Basics ](https://dev.to/rudrakshi99/linux-basics-2onj)\n- [@course@Coursera - Unix Courses](https://www.coursera.org/courses?query=unix)\n- [@feed@Explore top posts about Linux](https://app.daily.dev/tags/linux?ref=roadmapsh)\n",
    "management@UyIwiIiKaa6LTQaqzbCam": "# Management\n\nManagement in software architects encompasses various responsibilities and practices that ensure the successful design, development, and implementation of software systems. Software architects play a critical role in bridging the gap between business requirements and technical implementation. \n\nVisit the following resources to learn more:\n\n- [@article@Wikipedia](https://en.wikipedia.org/wiki/Management)",
    "marketing-skills@YW6j3Sg511dXToTcwSnOS": "# Marketing Skills\n\nMarketing skills are essential for promoting your ideas effectively, especially when others may not immediately embrace them. To convince others, it's crucial to motivate them by demonstrating the value and benefits of your ideas in an easily digestible format, such as through prototypes or videos. Persistence is key; if you're convinced of your idea’s worth, you need to fight for it, even if it's met with resistance. Establishing allies who support your ideas can also make it easier to gain traction, so start building a network. Repeating your message regularly can help, but be cautious not to overdo it, as credibility is essential for long-term success.\n\nVisit the following resources to learn more:  \n\n- [@article@Marketing Skills for Architects](https://openasset.com/blog/marketing-for-architects/)  \n",
    "messaging-queues@4NVdEbmpQVHpBc7582S6E": "# Messaging queues\n\nMessage queuing makes it possible for applications to communicate asynchronously, by sending messages to each other via a queue. A message queue provides temporary storage between the sender and the receiver so that the sender can keep operating without interruption when the destination program is busy or not connected.\n\nVisit the following resources to learn more:\n\n- [@article@Messaging Queues](https://aws.amazon.com/message-queue/)\n- [@article@Messaging Queues Tutorial](https://www.tutorialspoint.com/inter_process_communication/inter_process_communication_message_queues.htm)\n",
    "microfrontends@vpko5Kyf6BZ5MHpxXOKaf": "# Microfrontends\n\nMicrofrontends is an architectural style where independently deliverable frontend applications built by different teams using different technologies are composed into a greater whole. Simply, a Micro-Frontend is a portion of a webpage (not the entire page). There is a “Host” or a “Container” page in the Micro-Frontend Architecture page that can host one or more Micro-Frontends.\n\nVisit the following resources to learn more:\n\n- [@article@Micro Frontends](https://micro-frontends.org/)\n- [@video@Micro-Frontends Course - Beginner to Expert](https://www.youtube.com/watch?v=lKKsjpH09dU)\n- [@feed@Explore top posts about Web Development](https://app.daily.dev/tags/webdev?ref=roadmapsh)\n",
    "microservices@b6lCGw82qKpUmsxe1r1f5": "# Microservices\n\nMicroservice architecture is a pattern in which highly cohesive, loosely coupled services are separately developed, maintained, and deployed. Each component handles an individual function, and when combined, the application handles an overall business function.\n\nVisit the following resources to learn more:\n\n- [@official@Pattern: Microservice Architecture](https://microservices.io/patterns/microservices.html)\n- [@article@What is Microservices?](https://smartbear.com/solutions/microservices/)\n- [@article@Microservices 101](https://thenewstack.io/microservices-101/)\n- [@article@Primer: Microservices Explained](https://thenewstack.io/primer-microservices-explained/)\n- [@article@Articles about Microservices](https://thenewstack.io/category/microservices/)\n- [@feed@Explore top posts about Microservices](https://app.daily.dev/tags/microservices?ref=roadmapsh)\n",
    "ms-dynamics@gdtI0H_PzzTj_aFQn_NeA": "# MS Dynamics\n\nMicrosoft Dynamics 365 is a combination of both Enterprise Resource Planning (ERP) software and Customer Relationship Management (CRM) software.\n\nVisit the following resources to learn more:\n\n- [@article@Everything you ever wanted to know about Microsoft Dynamics](https://www.nigelfrank.com/insights/everything-you-ever-wanted-to-know-about-dynamics-crm)\n- [@video@What is Microsoft Dynamics?](https://www.youtube.com/watch?v=ogfclHWgqgE)\n",
    "mvc-mvp-mvvm@jj5otph6mEYiR-oU5WVtT": "# MVC MVP MVVM\n\nModel-view-controller, or MVC, is a pattern used to separate user-interface, data and application logic.\nIt does this by separating an application into three parts: Model, View, and Controller. The model holds the data, the view encompasses the user-interface, and the controller acts as a mediator between the two.\n\nModel-view-presenter, or MVP, was designed to ease automated unit testing and improve the separation of concerns in presentation logic. MVP is a variant of the MVC pattern, though differs in that it divides the application into the user-interface (view), data (model) and presentation logic (presenter). While the model and the view represent stay the same as in the model-view-controller pattern, the presenter differs from the controller in that it manipulates the model and updates the view.\n\nAnother variant of the MVC is the model-view-viewmodel pattern. The Model-view-viewmodel, or MVVM, separates the application into three core components: Model, View, and View Model. While the view and model represent all that they did in their parent pattern, the view model acts as a link between the model and view, retrieves data from the model and exposes it to the view through two-way data binding and can manipulate the model's data.\n\nVisit the following resources to learn more:\n\n- [@article@MVC, MVP and MVVM Design Pattern](https://medium.com/@ankit.sinhal/mvc-mvp-and-mvvm-design-pattern-6e169567bbad)\n- [@feed@Explore top posts about General Programming](https://app.daily.dev/tags/general-programming?ref=roadmapsh)\n",
    "net-framework-based@D1IXOBUrrXf5bXhVu9cmI": "# .NET Framework\n\n.NET is an open-source platform with tools and libraries for building web, mobile, desktop, games, IoT, cloud, and microservices.\n\nOfficially supported languages in .NET: C#, F#, Visual Basic.\n\nVisit the following resources to learn more:\n\n- [@official@.NET Website](https://dotnet.microsoft.com/en-us/)\n- [@official@What is .NET?](https://dotnet.microsoft.com/en-us/learn/dotnet/what-is-dotnet)\n- [@official@Why Choose .NET?](https://dotnet.microsoft.com/en-us/platform/why-choose-dotnet)\n- [@official@C# Documentation](https://learn.microsoft.com/en-us/dotnet/csharp/?WT.mc_id=dotnet-35129-website)\n- [@official@F# Documentation](https://learn.microsoft.com/en-us/dotnet/fsharp/?WT.mc_id=dotnet-35129-website)\n- [@official@Visual Basic Documentation](https://learn.microsoft.com/en-us/dotnet/visual-basic/?WT.mc_id=dotnet-35129-website)\n- [@feed@Explore top posts about .NET](https://app.daily.dev/tags/.net?ref=roadmapsh)\n",
    "networks@cBWJ6Duw99tSKr7U6OW3A": "# Networks\n\nA computer network is a set of computers sharing resources located on or provided by network nodes. Computers use common communication protocols over digital interconnections to communicate with each other. These interconnections are made up of telecommunication network technologies based on physically wired, optical, and wireless radio-frequency methods that may be arranged in a variety of network topologies.\n\nVisit the following resources to learn more:\n\n- [@article@Networking - IBM](https://www.ibm.com/topics/networking)\n- [@article@Networking - Wikipedia](https://en.wikipedia.org/wiki/Networking)\n- [@article@Networking Basics](https://www.cisco.com/c/en/us/solutions/small-business/resource-center/networking/networking-basics.html)\n",
    "nosql-databases@57liQPaPyVpE-mdLnsbi0": "# Nosql databases\n\nNoSQL databases (aka \"not only SQL\") are non-tabular databases and store data differently than relational tables. NoSQL databases come in a variety of types based on their data model. The main types are document, key-value, wide-column, and graph. They provide flexible schemas and scale easily with large amounts of data and high user loads.\n\nTypes of NoSQL databases\n\n- Document databases Ex. MongoDB\n- Key-value databases Ex. Redis\n- Wide-column databases Ex. Cassandra\n- Graph databases Ex. Neo4J\n\nVisit the following resources to learn more:\n\n- [@article@NoSQL Database - AWS](https://aws.amazon.com/nosql/)\n- [@article@NoSQL Databases](https://www.mongodb.com/resources/basics/databases/nosql-explained)\n- [@feed@Explore top posts about NoSQL](https://app.daily.dev/tags/nosql?ref=roadmapsh)\n",
    "oop@AMDLJ_Bup-AY1chl_taV3": "# OOP\n\nObject-oriented programming (OOP) is a computer programming model that organizes software design around data, or objects, rather than functions and logic. An object can be defined as a data field that has unique attributes and behavior.\n\nVisit the following resources to learn more:\n\n- [@article@OOP - Wikipedia](https://en.wikipedia.org/wiki/Object-oriented_programming)\n- [@article@Basic Concepts of Object-Oriented Programming](https://developer.mozilla.org/en-US/docs/Learn/JavaScript/Objects/Object-oriented_programming)\n- [@video@FreeCodeCamp - (OOP) in C++](https://www.youtube.com/watch?v=wN0x9eZLix4)\n- [@video@FreeCodeCamp - (OPP) in Python](https://www.youtube.com/watch?v=Ej_02ICOIgs)\n",
    "operations-knowledge@EdJhuNhMSWjeVxGW-RZtL": "# Operations Knowledge\n\nOperational knowledge refers to the understanding and insights that software architects need to effectively design, implement, and manage software systems throughout their lifecycle. This knowledge encompasses various aspects of software development, deployment, and maintenance, and it is crucial for ensuring that systems operate efficiently, reliably, and securely.\n",
    "osi@Mt5W1IvuHevNXVRlh7z26": "# OSI and TCP/IP Models\n\nThe OSI and TCP/IP model is used to help the developer to design their system for interoperability. The OSI model has 7 layers while the TCP/IP model has a more summarized form of the OSI model only consisting 4 layers. This is important if you're trying to design a system to communicate with other systems.\n\nVisit the following resources to learn more:\n\n- [@article@Cloudflare - What is the OSI model](https://www.cloudflare.com/learning/ddos/glossary/open-systems-interconnection-model-osi/)\n",
    "owasp@KhqUK-7jdClu9M2Pq7x--": "# OWASP\n\nOWASP or Open Web Application Security Project is an online community that produces freely-available articles, methodologies, documentation, tools, and technologies in the field of web application security.\n\nVisit the following resources to learn more:\n\n- [@opensource@OWASP Web Application Security Testing Checklist](https://github.com/0xRadi/OWASP-Web-Checklist)\n- [@article@Wikipedia - OWASP](https://en.wikipedia.org/wiki/OWASP)\n- [@article@OWASP Top 10 Security Risks](https://sucuri.net/guides/owasp-top-10-security-vulnerabilities-2021/)\n- [@article@OWASP Cheatsheets](https://cheatsheetseries.owasp.org/cheatsheets/AJAX_Security_Cheat_Sheet.html)\n",
    "patterns--design-principles@_U0VoTkqM1d6NR13p5azS": "# Patterns and design principles\n\nIn the realm of software architecture, patterns and design principles are foundational tools that enable architects to create robust, scalable, and maintainable systems. They offer proven solutions to common problems and guide decision-making throughout the software development lifecycle. Understanding these concepts is essential for anyone following a software architect roadmap, as they bridge the gap between high-level architecture and practical implementation.\n",
    "pki@OpL2EqvHbUmFgnpuhtZPr": "# PKI\n\nA public key infrastructure (PKI) is a set of roles, policies, hardware, software, and procedures to create, manage, distribute, use, store and revoke digital certificates and public-key encryption. The purpose of a PKI is to facilitate the secure electronic transfer of information for a range of network activities such as e-commerce, internet banking, and confidential email. It is required for activities where simple passwords are an inadequate authentication method, and the more rigorous proof is required to confirm the identity of the parties involved in the communication and to validate the information being transferred.\n\nVisit the following resources to learn more:\n\n- [@article@PKI - Wikipedia](https://en.wikipedia.org/wiki/Public_key_infrastructure)\n- [@article@PKI - DoD Cyber Exchange](https://public.cyber.mil/pki-pke/)",
    "pmi@hRug9yJKYacB9X_2cUalR": "# PMI\n\nThe PMI certification (Project Management Institute) is an internationally recognized credential in project management. The most well-known is the PMP® (Project Management Professional), which validates the skills and knowledge of professionals to manage projects effectively by applying best practices and standards defined in the PMBOK® (Project Management Body of Knowledge) guide.\n\nVisit the following resources to learn more:\n\n- [@official@Project Management Institute](https://www.pmi.org/)\n",
    "prince2@SJ5lrlvyXgtAwOx4wvT2W": "# Prince2\n\nPrince2 is a structured project management method and practitioner certification programme. Prince2 emphasizes dividing projects into manageable and controllable stages. It is adopted in many countries worldwide, including the UK, Western European countries, and Australia.\n\nVisit the following resources to learn more:\n\n- [@official@Prince2 Certification](https://www.axelos.com/certifications/propath/prince2-project-management)\n- [@course@Prince2 Project Management Course](https://www.simplilearn.com/project-management/prince2-foundation-and-practitioner-certification-training)",
    "programming-languages@uoDtVFThaV6OMK2wXGfP5": "# Programming Languages\n\nA programming language is a system of notation for writing computer programs. Programming languages are described in terms of their syntax and semantics, usually defined by a formal language. Languages usually provide features such as a type system, variables, and mechanisms for error handling.\n\nVisit the following resources to learn more:\n\n- [@article@Programming Language](https://en.wikipedia.org/wiki/Programming_language)",
    "proxies@6_EOmU5GYGDGzmNoLY8cB": "# Proxies\n\nIn computer networking, a proxy server is a server application that acts as an intermediary between a client requesting a resource and the server providing that resource.\n\nVisit the following resources to learn more:\n\n- [@article@Proxy Server](https://en.wikipedia.org/wiki/Proxy_server)",
    "python@j2Ph2QcKwmKlbaMHz1l_i": "# Python\n\nPython is a multi-paradigm language. Being an interpreted language, code is executed as soon as it is written and the Python syntax allows for writing code in functional, procedural or object-oriented programmatic ways. Python is frequently recommended as the first language new coders should learn, because of its focus on readability, consistency, and ease of use. This comes with some downsides, as the language is not especially performant in most production tasks.\n\nVisit the following resources to learn more:\n\n- [@roadmap@Visit Dedicated Python Roadmap](https://roadmap.sh/python)\n- [@official@Python Website](https://www.python.org/)\n- [@official@Python Getting Started](https://www.python.org/about/gettingstarted/)\n- [@article@Automate the Boring Stuff](https://automatetheboringstuff.com/)\n- [@article@Python Crash Course](https://ehmatthes.github.io/pcc/)\n- [@feed@Explore top posts about Python](https://app.daily.dev/tags/python?ref=roadmapsh)\n",
    "react-vue-angular@mCiYCbKIOVU34qil_q7Hg": "# React\n\nReact is the most popular front-end JavaScript library for building user interfaces. React can also render on the server using Node and power mobile apps using React Native.\n\nVue.js is a progressive JavaScript framework designed for building user interfaces and single-page applications.\n\nAngular is a TypeScript-based open-source front-end web application framework led by the Angular Team at Google.\n\nVisit the following resources to learn more:\n\n- [@roadmap@Visit Dedicated React Roadmap](https://roadmap.sh/react)\n- [@roadmap@Visit Dedicated Vue Roadmap](https://roadmap.sh/vue)\n- [@roadmap@Visit Dedicated Angular Roadmap](https://roadmap.sh/angular)\n- [@official@React](https://react.dev/)\n- [@official@Vue.js](https://vuejs.org/)\n- [@official@Angular](https://angular.dev/)\n- [@video@React JS Course for Beginners](https://www.youtube.com/watch?v=nTeuhbP7wdE)\n- [@video@Vue.js Course for Beginners](https://www.youtube.com/watch?v=FXpIoQ_rT_c)\n- [@video@Angular Course for Beginners](https://www.youtube.com/watch?v=3qBXWUpoPHo)\n- [@feed@Explore top posts about Angular](https://app.daily.dev/tags/angular?ref=roadmapsh)\n",
    "reactive-programming@C0g_kQFlte5siHMHwlHQb": "# Reactive Programming\n\nReactive programming describes a design paradigm that relies on asynchronous programming logic to handle real-time updates to otherwise static content. It provides an efficient means -- the use of automated data streams -- to handle data updates to content whenever a user makes an inquiry.\n\nVisit the following resources to learn more:\n\n- [@article@What is Reactive Programming?](https://www.techtarget.com/searchapparchitecture/definition/reactive-programming)\n",
    "responsibilities@rUxbG2S2nJuA1YVY6sjiX": "# Architect Responsibilities\n\nTo understand the necessary skills an architect needs, we first need to understand typical activities. The following list contains from my perspective the most important activities:\n\n- Define and decide development technology and platform\n- Define development standards, e.g., coding standards, tools, review processes, test approach, etc.\n- Support identifying and understanding business requirements\n- Design systems and take decisions based on requirements\n- Document and communicate architectural definitions, design and decisions\n- Check and review architecture and code, e.g., check if defined patterns and coding standards are implemented properly\n- Collaborate with other architects and stakeholders\n- Coach and consult developers\n- Make sure that as implementation takes place, the architecture is being adhered to\n- Play a key part in reviewing code\n- Detail out and refine higher level design into lower level design\n\nVisit the following resources to learn more:\n\n- [@article@Software Architect](https://en.wikipedia.org/wiki/Software_architect)",
    "rest@Ss43xwK1ydEToj6XmmCt7": "# REST\n\nREST, or REpresentational State Transfer, is an architectural style for providing standards between computer systems on the web, making it easier for systems to communicate with each other.\n\nVisit the following resources to learn more:\n\n- [@article@What is a REST API?](https://www.redhat.com/en/topics/api/what-is-a-rest-api)\n- [@article@Roy Fieldings dissertation chapter, Representational State Transfer (REST)](https://www.ics.uci.edu/~fielding/pubs/dissertation/rest_arch_style.htm)\n- [@article@Learn REST: A RESTful Tutorial](https://restapitutorial.com/)\n- [@feed@Explore top posts about REST API](https://app.daily.dev/tags/rest-api?ref=roadmapsh)\n",
    "ruby@U_Hmzfjjs1jVtu2CZ0TlG": "# Ruby\n\nRuby is a high-level, interpreted programming language that blends Perl, Smalltalk, Eiffel, Ada, and Lisp. Ruby focuses on simplicity and productivity along with a syntax that reads and writes naturally. Ruby supports procedural, object-oriented and functional programming and is dynamically typed.\n\nVisit the following resources to learn more:\n\n- [@official@Ruby](https://www.ruby-lang.org/en/)\n- [@official@Learn Ruby in 20 minutes](https://www.ruby-lang.org/en/documentation/quickstart/)\n- [@feed@Explore top posts about Ruby](https://app.daily.dev/tags/ruby?ref=roadmapsh)\n",
    "rup@7rudOREGG-TTkCosU0hNw": "# RUP\n\nThe RUP (**Rational Unified Process**) is not a widely recognized certification like PMP or Scrum, but rather a software development framework created by Rational Software (now IBM). It follows an iterative and incremental approach to project development, based on best practices for delivering high-quality software on time and within budget.\n\nVisit the following resources to learn more:\n\n- [@official@IBM Certified Solution Designer RUP](https://www.ibm.com/training/certification/ibm-certified-solution-designer-ibm-rational-unified-process-v70-38008003)\n",
    "safe@Bg7ru1q1j6pNB43HGxnHT": "# SAFe\n\n**SAFe** is an agile framework designed to scale agile practices in large and complex organizations. Unlike LeSS, SAFe is more structured and provides a formal approach to coordinating multiple teams, programs, and portfolios. It incorporates elements of `Lean`, `DevOps`, and `agile principles`, and defines additional roles, ceremonies, and artifacts to align teams' goals with the business strategy. SAFe enables **large-scale planning**, **continuous delivery**, and **improvement of organizational efficiency**, offering a comprehensive framework for agile transformation at the corporate level.\n\nVisit the following resources to learn more:\n\n- [@official@SAFe 6.0](https://scaledagileframework.com/SAFE)\n- [@video@SAFe explained in five minutes](https://www.youtube.com/watch?v=aW2m-BtCJyE&t=2s)\n",
    "salesforce@mOXyzdNn8W-9R99ffcnor": "# Salesforce\n\nSalesforce is a cloud platform helping companies to manage relationships with their customers\n\nVisit the following resources to learn more:\n\n- [@article@What is Salesforce and what is it used for?](https://ascendix.com/blog/what-is-salesforce-what-salesforce-is-used-for/)\n- [@video@What is Salesforce?](https://www.youtube.com/watch?v=xx2sK-QiBjw)\n- [@feed@Explore top posts about Salesforce](https://app.daily.dev/tags/salesforce?ref=roadmapsh)\n",
    "sap-erp-hana-business-objects@TxWAznp1tUtZ1MvThf9M1": "# SAP ERP, HANA, Business Objects\n\nSAP (Systems, Applications, and Products in Data Processing) is a leading enterprise resource planning (ERP) software provider that helps organizations manage their business operations and customer relations effectively. SAP ERP integrates various business processes, such as finance, sales, procurement, and human resources, into a unified system, enabling real-time data access and improved decision-making. SAP HANA (High-Performance Analytic Appliance) is an in-memory database and application development platform that allows businesses to process large volumes of data quickly and efficiently, supporting advanced analytics and real-time reporting. BusinessObjects, part of the SAP Business Intelligence suite, provides powerful tools for data visualization, reporting, and analysis, enabling users to transform raw data into actionable insights. Together, these solutions empower organizations to streamline operations, enhance productivity, and drive strategic decision-making through data-driven insights.\n\nVisit the following resources to learn more:\n\n- [@official@SAP](https://www.sap.com/)\n",
    "scrum@PKqwKvoffm0unwcFwpojk": "# Scrum\r\n\r\n`Scrum` is a popular agile framework used for project management, particularly in software development. It emphasizes iterative development, collaboration, and flexibility to deliver high-quality products.\r\n\r\nKey elements of Scrum:\r\n\r\n- **Sprints**: Time-boxed iterations (usually 2-4 weeks) where teams work on specific goals.\r\n- **Product Backlog**: Prioritized list of features or requirements for the product.\r\n- **Sprint Backlog**: Selected items from the Product Backlog to be completed during a Sprint.\r\n- **Daily Scrum (Stand-up)**: Brief daily meeting where team members share progress, challenges, and plans for the day.\r\n- **Sprint Review**: Meeting at the end of a Sprint to demonstrate completed work and gather feedback.\r\n- **Sprint Retrospective**: Meeting to reflect on the Sprint, identify improvements, and adjust processes for the next Sprint.\r\n\r\nVisit the following resources to learn more:\r\n\r\n- [@article@What is Scrum and How to Get Started](https://www.atlassian.com/agile/scrum.)\r\n- [@article@Scrum Methodology: The Complete Guide & Best Practices](https://thedigitalprojectmanager.com/projects/pm-methodology/scrum-methodology-complete-guide/)\r\n- [@article@Essential Topics for the Scrum Product Owner](https://www.scrum.org/resources/blog/essential-topics-scrum-product-owner)\r\n- [@article@Scrum • Topics - Thriving Technologist](https://thrivingtechnologist.com/topics/scrum/)",
    "security@IzFTn5-tQuF_Z0cG_w6CW": "# Security\n\nSecurity is a broad field that encompasses various measures and practices designed to protect information, systems, and networks from unauthorized access, damage, or theft. It is essential in safeguarding sensitive data and maintaining the integrity and availability of resources. \n\nVisit the following resources to learn more:\n\n- [@article@Security - Wikipedia](https://en.wikipedia.org/wiki/Security)\n- [@article@Architect Security](https://aws.amazon.com/blogs/architecture/lets-architect-security-in-software-architectures/)\n",
    "serverless-concepts@WoXoVwkSqXTP5U8HtyJOL": "# Serverless Concepts\n\nServerless is a cloud-native development model that allows developers to build and run applications without having to manage servers. There are still servers in serverless, but they are abstracted away from app development. A cloud provider handles the routine work of provisioning, maintaining, and scaling the server infrastructure. Developers can simply package their code in containers for deployment.\n\nVisit the following resources to learn more:\n\n- [@article@What is Serverless?](https://www.redhat.com/en/topics/cloud-native-apps/what-is-serverless)\n- [@article@What is Serverless Computing?](https://www.cloudflare.com/learning/serverless/what-is-serverless/)\n- [@article@Serverless on AWS](https://aws.amazon.com/serverless/)\n- [@feed@Explore top posts about Serverless](https://app.daily.dev/tags/serverless?ref=roadmapsh)\n",
    "serverless@FAXKxl3fWUFShYmoCsInZ": "# Serverless\n\nServerless architecture (also known as serverless computing or function as a service, FaaS) is a software design pattern where applications are hosted by a third-party service, eliminating the need for server software and hardware management by the developer. Applications are broken up into individual functions that can be invoked and scaled individually.\n\nVisit the following resources to learn more:\n\n- [@article@Serverless Architectures By AWS](https://aws.amazon.com/lambda/serverless-architectures-learn-more/)\n- [@article@Serverless in Detail](https://martinfowler.com/articles/serverless.html)\n- [@feed@Explore top posts about Serverless](https://app.daily.dev/tags/serverless?ref=roadmapsh)\n",
    "service-mesh@OErbfM-H3laFm47GCHNPI": "# Service Mesh\n\nA Service Mesh is a dedicated infrastructure layer for handling service-to-service communication. It’s responsible for the reliable delivery of requests through the complex topology of services that comprise a modern, cloud native application. In layman's terms, it's a tool which helps you to control how different services communicate with each other.\n\nVisit the following resources to learn more:\n\n- [@video@Service Mesh explained in 15 Minutes](https://youtu.be/16fgzklcF7Y)\n- [@article@Red Hat - What is a Service Mesh?](https://www.redhat.com/en/topics/microservices/what-is-a-service-mesh)\n- [@article@Kubernetes Service Mesh - Blog Post](https://platform9.com/blog/kubernetes-service-mesh-a-comparison-of-istio-linkerd-and-consul/)\n- [@feed@Explore top posts about Service Mesh](https://app.daily.dev/tags/service-mesh?ref=roadmapsh)\n",
    "service-oriented@6uvmMgvOwGyuLC5TOhjFu": "# Service oriented\n\nService-oriented architecture (SOA) is an enterprise-wide approach to software development of application components that takes advantage of reusable software components, or services.\n\nSOA provides four different service types:\n\n1. Functional services (i.e., business services), which are critical for business applications.\n2. Enterprise services, which serve to implement functionality.\n3. Application services, which are used to develop and deploy apps.\n4. Infrastructure services, which are instrumental for backend processes like security and authentication.\n\nVisit the following resources to learn more:\n\n- [@article@SOA Architecture By AWS](https://aws.amazon.com/what-is/service-oriented-architecture/)\n",
    "simplifying-things@lrtgF1RTaS4TCKww0aY6C": "# Simplifying Things\n\nSimplifying solutions is critical for effective problem-solving, aligning with Occam’s Razor, which favors simplicity by reducing unnecessary assumptions. To achieve this, “shake” your solution by analyzing it from different perspectives and questioning its assumptions. After complex discussions, take a step back to review the big picture and refactor if needed, giving your brain time to process ideas. Apply the *divide and conquer* method to break problems into smaller parts and validate their integration afterward. Finally, remember that refactoring is a valuable process to improve overly complex solutions, provided there’s adequate test coverage and stakeholder support.\n\nVisit the following resources to learn more:\n\n- [@article@Simplifying Things](https://www.infoq.com/articles/driving-architectural-simplicity/)\n",
    "slack@CYnUg_okOcRrD7fSllxLW": "# Slack\n\nSlack is a messaging app for business that connects people to the information that they need. By bringing people together to work as one unified team, Slack transforms the way that organisations communicate.\n\nVisit the following resources to learn more:\n\n- [@official@Slack](https://slack.com)\n- [@official@Getting Started with Slack](https://slack.com/intl/en-in/help/categories/360000049043)\n- [@video@What is Slack?](https://www.youtube.com/watch?v=q19RtuCHt1Q)\n- [@feed@Explore top posts about Slack](https://app.daily.dev/tags/slack?ref=roadmapsh)\n",
    "solid@QNG-KP01WQnq8o1-In1-n": "# SOLID\n\nSOLID is a set of principles applied to object-oriented design (OOD) to create maintainable, understandable, and flexible code, while avoiding code smells and defects. The principles are:\n\n- Single Responsibility\n- Open/Closed\n- Liskov Substitution\n- Interface Segregation\n- Dependency Inversion\n\nVisit the following resources to learn more:\n\n- [@article@SOLID Principles](https://www.baeldung.com/solid-principles)\n- [@article@SOLID: The First 5 Principles of Object Oriented Design](https://www.digitalocean.com/community/conceptual_articles/s-o-l-i-d-the-first-five-principles-of-object-oriented-design)\n",
    "solution-architecture@uGs-9xE3DMJxKhenltbFK": "# Solution Level Architecture\n\nThe mid-level of architecture. Focus on one or more applications which fulfill a business need (business solution). Some high, but mainly low-level design. Communication is between multiple development teams.\n\nVisit the following resources to learn more:\n\n- [@article@Solution Architecture](https://www.leanix.net/en/wiki/it-architecture/solution-architecture)\n",
    "spa-ssr-ssg@ulwgDCQi_BYx5lmll7pzU": "# SPA vs SSG vs SSR\n\n- **SPA**: A single page application loads only a single web document from the server and then updates the content of that document on demand via `Javascript APIs` without reloading the entire document. React, Vue, Angular are the top frameworks used to create single page applications.\n- **SSR**: This technique uses a server like `Node.js` to fully render the web document upon the receival of a request and then send it back to the client. This way the user get an interactive document with all the necessary information without having to wait for any JavaScript or CSS files to load.\n- **SSG**: Static site generation renders the web document in the server(like SSR), however the page is rendered at **build time**. So, instead of rendering the page on the server upon the receival of a request, the page is already rendered in the server, waiting to be served to the client.\n\nVisit the following resources to learn more:\n\n- [@article@Web Design Patterns — SSR, SSG, and SPA](https://medium.com/codex/web-design-patterns-ssr-ssg-and-spa-fadad7673dfe)\n- [@article@Rendering on the Web](https://web.dev/rendering-on-the-web/)\n- [@feed@Explore top posts about Web Development](https://app.daily.dev/tags/webdev?ref=roadmapsh)\n",
    "sql-databases@n5AcBt_u8qtTe3PP9svPZ": "# Sql databases\n\nSQL stands for Structured Query Language. It's used for relational databases. A SQL database is a collection of tables that stores a specific set of structured data. Examples of SQL Databases includes MariaDB, MySQL and PostgreSQL.\n\nVisit the following resources to learn more:\n\n- [@roadmap@Visit Dedicated SQL Roadmap](https://roadmap.sh/sql)\n- [@article@What is SQL? - AWS](https://aws.amazon.com/what-is/sql/)\n- [@article@SQL Databases](https://www.openlogic.com/blog/what-sql-database)\n- [@feed@Explore top posts about SQL](https://app.daily.dev/tags/sql?ref=roadmapsh)\n",
    "tcpip-model@UCCT7-E_QUKPg3jAsjobx": "# TCP/IP Model\r\n\r\nThe `TCP/IP model` defines how devices should transmit data between them and enables communication over networks and large distances. The model represents how data is exchanged and organized over networks. It is split into four layers, which set the standards for data exchange and represent how data is handled and packaged when being delivered between applications, devices, and servers.\r\n\r\n- **Network Access Layer**: The network access layer is a group of applications requiring network communications. This layer is responsible for generating the data and requesting connections.\r\n\r\n- **Internet Layer**: The internet layer is responsible for sending packets from a network and controlling their movement across a network to ensure they reach their destination. \r\n\r\n- **Transport Layer**: The transport layer is responsible for providing a solid and reliable data connection between the original application or device and its intended destination. \r\n\r\n- **Application Layer**: The application layer refers to programs that need TCP/IP to help them communicate with each other. \r\n\r\nVisit the following resources to learn more:\r\n\r\n- [@article@What is Transmission Control Protocol TCP/IP? - Fortinet](https://www.fortinet.com/resources/cyberglossary/tcp-ip#:~:text=The%20TCP%2FIP%20model%20defines,exchanged%20and%20organized%20over%20networks.)\r\n- [@article@What is TCP/IP and How Does it Work?](https://www.techtarget.com/searchnetworking/definition/TCP-IP)git reset",
    "tdd@DnP66pjK3b8tCtYr05n2G": "# Test Driven Development\n\nTest driven development (TDD) is the process of writing tests for software's requirements which will fail until the software is developed to meet those requirements. Once those tests pass, then the cycle repeats to refactor code or develop another feature/requirement. In theory, this ensures that software is written to meet requirements in the simplest form, and avoids code defects.\n\nVisit the following resources to learn more:\n\n- [@article@What is Test Driven Development (TDD)?](https://www.guru99.com/test-driven-development.html)\n- [@article@Test-driven development](https://www.ibm.com/garage/method/practices/code/practice_test_driven_development/)\n- [@video@Agile in Practice: Test Driven Development](https://youtu.be/uGaNkTahrIw)\n- [@feed@Explore top posts about TDD](https://app.daily.dev/tags/tdd?ref=roadmapsh)\n",
    "technical-skills@hFx3mLqh5omNxqI9lfaAQ": "# Technical Skills\n\n- Experience in software development\n- Experience in project management\n- Knowledge of one or more programming languages, such as Java, Python, JavaScript, Ruby, Rust, and C\n- Knowledge of different development platforms\n- Understanding of web applications, cybersecurity, and open source technologies\n- Proficiency in analyzing code for issues and errors\n- Experience in database platforms\n- Experience with Operations and DevOps Skills\n",
    "togaf@5TDTU22Fla2mRr6JeOcaY": "# Togaf\n\nThe TOGAF content framework provides a detailed model of architectural work products, including deliverables, artifacts within deliverables, and the architectural building blocks that artifacts represent.\n\nVisit the following resources to learn more:\n\n- [@official@Togaf](https://www.opengroup.org/togaf)\n- [@article@Wikipedia](https://en.wikipedia.org/wiki/The_Open_Group_Architecture_Framework)\n",
    "tools@SuMhTyaBS9vwASxAt39DH": "# Architect Tools\n\nArchitect tools are software tools that help architects to design, document, and manage software architectures. These tools can be used to create architecture diagrams, generate code, and automate the software development process.\n",
    "trello@a6joS9WXg-rbw29_KfBd9": "# Trello\n\nTrello is the visual tool that empowers your team to manage any type of project, workflow, or task tracking.\n\nVisit the following resources to learn more:\n\n- [@official@Trello](https://trello.com)\n- [@official@Trello Guide](https://trello.com/guide)\n- [@video@A Tour Of Trello](https://www.youtube.com/watch?v=AyfupeWS0yY)\n",
    "uml@8FTKnAKNL9LnZBrw9YXqK": "# UML\n\nThe Unified Modeling Language, or UML, is a modeling language that is intended to provide a standard way to visualize and describe the design of a system.\n\nVisit the following resources to learn more:\n\n- [@official@UML Website](https://www.uml.org)\n- [@article@UML Pattern - IBM](https://www.ibm.com/docs/en/rational-soft-arch/9.6.1?topic=files-uml-pattern-frameworks)\n- [@article@The Unified Modeling Language Reference Manual (Second Edition)](https://personal.utdallas.edu/~chung/Fujitsu/UML_2.0/Rumbaugh--UML_2.0_Reference_CD.pdf)\n- [@article@Wikipedia](https://en.wikipedia.org/wiki/Unified_Modeling_Language)\n",
    "understand-the-basics@4zicbh7Wg2lmKSRhb6E-L": "# Software Architect Basics\n\nUnderstand different concepts such as what is software architecture, software architect, different types of architects and so on.\n",
    "w3c-and-whatwg@s0RvufK2PLMXtlsn2KAUN": "# W3c and WHATWG Standards\n\nWorld Wide Web Consortium (W3C) standards define the best practices for web development to enable developers to build rich interactive experiences that are available on any device. Theses standards range from recommended web technologies such as HTML, CSS, XML to the generally accepted principles of web architecture, semantics and services.\n\nWeb Hypertext Application Technology Working Group (WHATWG) is another set of web standards that came into existence after W3C announced that it was going to be focusing on XHTML over HTML.\n\nVisit the following resources to learn more:\n\n- [@official@W3C Standards](https://www.w3.org/standards/)\n- [@official@WHATWG Standards](https://spec.whatwg.org/)\n",
    "web-mobile@j9Y2YbBKi3clO_sZ2L_hQ": "# Web and Mobile\n\nWeb apps and mobile apps are two distinct types of software applications designed to run on different platforms. Web apps are accessed through web browsers and run on various devices using internet connectivity. They are platform-independent, making them easy to update and maintain, but often require an active internet connection. Mobile apps, on the other hand, are specifically developed for mobile operating systems like Android and iOS, providing enhanced performance, offline functionality, and seamless access to device features such as GPS, cameras, and sensors. While web apps prioritize accessibility and cost-effectiveness, mobile apps focus on delivering a tailored and optimized user experience.\n\nVisit the following resources to learn more:\n\n- [@article@Web vs Mobile](https://buildfire.com/difference-between-web-app-and-mobile-app/)\n",
    "what-is-a-software-architect@eG38hT0rotYJ3G-t9df9R": "# What is Software Architect?\n\nAn expert developer who design software solutions from the ground up, making high-level decisions about each stage of the process including technical standards, tools, design principles, platforms to be used, etc., leading a team of engineers to create the final product.\n\nVisit the following resources to learn more:\n\n- [@article@12 Skills a Software Architect Needs](https://www.redhat.com/architect/what-is-software-architect)\n",
    "what-is-software-architecture@EGG99VA-PEdWdVxNDLtG_": "# What is Software Architecture?\n\nDescribes how an application is built including its components, how they interact with each other, environment in which they operate and so on.\n\nVisit the following resources to learn more:\n\n- [@article@What is Software Architecture in Software Engineering?](https://www.computer.org/resources/software-architecture)\n- [@article@Software Architecture: It might not be what you think it is](https://www.infoq.com/articles/what-software-architecture/)\n- [@feed@Explore top posts about Architecture](https://app.daily.dev/tags/architecture?ref=roadmapsh)\n",
    "working-with-data@YCJYRA3b-YSm8vKmGUFk5": "# Working with Databases\n\nWorking with databases involves storing, managing, and retrieving data efficiently to support applications and business processes. Databases can be relational, like MySQL and PostgreSQL, which use structured tables and SQL for querying, or non-relational (NoSQL), like MongoDB and Cassandra, which handle unstructured or semi-structured data. Effective database management requires designing normalized schemas for relational databases, ensuring data integrity, and optimizing queries for performance. For NoSQL databases, it's important to choose the right type (e.g., document, key-value, columnar) based on application needs. Additionally, managing transactions, indexing, backups, and security are crucial for maintaining reliable and scalable database systems.\n\nVisit the following resources to learn more:\n\n- [@article@Introduction to Databases](https://www.digitalocean.com/community/conceptual-articles/an-introduction-to-databases)",
    "xp@7fL9lSu4BD1wRjnZy9tM9": "# Extreme Programming (XP)\r\n\r\n\r\n`Extreme Programming (XP)` is a popular agile software development framework that emphasizes speed, simplicity, and quality. It was developed by Kent Beck in the late 1990s and is based on five values:\r\n\r\n- **Communication**: Open and honest communication among team members and stakeholders is essential.\r\n- **Simplicity**: The simplest solution that works is always preferred.\r\n- **Feedback**: Continuous feedback from customers and team members is used to improve the product.\r\n- **Courage**: Team members must be willing to make changes and take risks.\r\n- **Respect**: Everyone on the team is treated with respect.\r\n\r\nVisit the following resources to learn more:\r\n\r\n- [@article@What is Extreme Programming (XP)?](https://www.agilealliance.org/glossary/xp/)\r\n- [@article@It's Values, Principles, And Practices](https://www.nimblework.com/agile/extreme-programming-xp/)\r\n- [@article@Extreme Programming (XP)](https://scrum-master.org/en/extreme-programming-xp-a-beginners-guide-to-the-agile-method/)"
  },
  "migration-mapping": {
    "software-architect-basics": "4zicbh7Wg2lmKSRhb6E-L",
    "software-architect-basics:what-is-software-architecture": "EGG99VA-PEdWdVxNDLtG_",
    "software-architect-basics:what-is-software-architect": "eG38hT0rotYJ3G-t9df9R",
    "software-architect-basics:levels-of-architecture": "2sR4KULvAUUoOtopvsEBs",
    "software-architect-basics:levels-of-architecture:solution-architecture": "uGs-9xE3DMJxKhenltbFK",
    "software-architect-basics:levels-of-architecture:application-architecture": "Lqe47l4j-C4OwkbkwPYry",
    "software-architect-basics:levels-of-architecture:enterprise-architecture": "vlW07sc-FQnxPMjDMn8_F",
    "architect-responsibilities": "rUxbG2S2nJuA1YVY6sjiX",
    "important-skills": "lBtlDFPEQvQ_xtLtehU0S",
    "important-skills:design-and-architecture": "fBd2m8tMJmhuNSaakrpg4",
    "important-skills:decision-making": "MSDo0nPk_ghRYkZS4MAQ_",
    "important-skills:simplifying-things": "lrtgF1RTaS4TCKww0aY6C",
    "important-skills:how-to-code": "77KvWCA1oHSGgDKBTwjv7",
    "important-skills:documentation": "5D-kbQ520k1D3fCtD01T7",
    "important-skills:communication": "Ac49sOlQKblYK4FZuFHDR",
    "important-skills:estimate-and-evaluate": "m0ZYdqPFDoHOPo18wKyvV",
    "important-skills:balance": "otHQ6ye1xgkI1qb4tEHVF",
    "important-skills:consult-and-coach": "LSWlk9A3b6hco9Il_elao",
    "important-skills:marketing-skills": "YW6j3Sg511dXToTcwSnOS",
    "technical-skills": "hFx3mLqh5omNxqI9lfaAQ",
    "programming-languages": "uoDtVFThaV6OMK2wXGfP5",
    "programming-languages:dotnet-framework": "D1IXOBUrrXf5bXhVu9cmI",
    "programming-languages:javascript-typescript": "bhP5gMpRVebSFpCeHVXBj",
    "programming-languages:python": "j2Ph2QcKwmKlbaMHz1l_i",
    "programming-languages:ruby": "U_Hmzfjjs1jVtu2CZ0TlG",
    "programming-languages:go": "nKlM9k4qAh4wBFXqM-2kC",
    "programming-languages:java-kotlin-scala": "a5DB_hsD4bAf8BtHNFNPo",
    "patterns-and-design-principles": "_U0VoTkqM1d6NR13p5azS",
    "patterns-and-design-principles:mvc-mvp-mvvm": "jj5otph6mEYiR-oU5WVtT",
    "patterns-and-design-principles:cqrs-eventual-consistency": "RsnN5bt8OhSMjSFmVgw-X",
    "patterns-and-design-principles:oop": "AMDLJ_Bup-AY1chl_taV3",
    "patterns-and-design-principles:actors": "AoWO2BIKG5X4JWir6kh5r",
    "patterns-and-design-principles:acid-cap-theorem": "bbKEEk7dvfFZBBJaIjm0j",
    "patterns-and-design-principles:solid": "QNG-KP01WQnq8o1-In1-n",
    "patterns-and-design-principles:tdd": "DnP66pjK3b8tCtYr05n2G",
    "patterns-and-design-principles:ddd": "IIelzs8XYMPnXabFKRI51",
    "architect-tools": "SuMhTyaBS9vwASxAt39DH",
    "architect-tools:git": "ZEzYb-i55hBe9kK3bla94",
    "architect-tools:slack": "CYnUg_okOcRrD7fSllxLW",
    "architect-tools:trello": "a6joS9WXg-rbw29_KfBd9",
    "architect-tools:atlassian-tools": "3bpd0iZTd3G-H8A7yrExY",
    "architectures": "OaLmlfkZid7hKqJ9G8oNV",
    "architectures:serverless": "FAXKxl3fWUFShYmoCsInZ",
    "architectures:client-server-architecture": "mka_DwiboH5sGFhXhk6ez",
    "architectures:layered-architecture": "05hLO2_A8Tr6cLJGFRhOh",
    "architectures:distributed-systems": "j7OP6RD_IAU6HsyiGaynx",
    "architectures:service-oriented": "6uvmMgvOwGyuLC5TOhjFu",
    "security": "IzFTn5-tQuF_Z0cG_w6CW",
    "security:hashing-algorithms": "7tBAD0ox9hTK4D483GTRo",
    "security:pki": "OpL2EqvHbUmFgnpuhtZPr",
    "security:owasp": "KhqUK-7jdClu9M2Pq7x--",
    "security:auth-strategies": "KiwFXB6yd0go30zAFMTJt",
    "working-with-data": "YCJYRA3b-YSm8vKmGUFk5",
    "working-with-data:hadoop-spark-mapreduce": "92GG4IRZ3FijumC94aL-T",
    "working-with-data:etl-datawarehouses": "JUFE4OQhnXOt1J_MG-Sjf",
    "working-with-data:sql-databases": "n5AcBt_u8qtTe3PP9svPZ",
    "working-with-data:nosql-databases": "57liQPaPyVpE-mdLnsbi0",
    "working-with-data:analytics:apache-spark": "a0baFv7hVWZGvS5VLh5ig",
    "working-with-data:analytics:hadoop": "I_VjjmMK52_tS8qjQUspN",
    "working-with-data:analytics:datawarehouses-principles": "B5YtP8C1A0jB3MOdg0c_q",
    "apis-and-integrations": "Ocn7-ctpnl71ZCZ_uV-uD",
    "apis-and-integrations:grpc": "priDGksAvJ05YzakkTFtM",
    "apis-and-integrations:esb-soap": "fELnBA0eOoE-d9rSmDJ8l",
    "apis-and-integrations:graphql": "Sp3FdPT4F9YnTGvlE_vyq",
    "apis-and-integrations:rest": "Ss43xwK1ydEToj6XmmCt7",
    "apis-and-integrations:bpm-bpel": "DwNda95-fE7LWnDA6u1LU",
    "apis-and-integrations:messaging-queues": "4NVdEbmpQVHpBc7582S6E",
    "web-and-mobile": "j9Y2YbBKi3clO_sZ2L_hQ",
    "web-and-mobile:reactive-functional-programming": "C0g_kQFlte5siHMHwlHQb",
    "web-and-mobile:react-vue-angular": "mCiYCbKIOVU34qil_q7Hg",
    "web-and-mobile:spa-ssr-ssg": "ulwgDCQi_BYx5lmll7pzU",
    "web-and-mobile:microfrontends": "vpko5Kyf6BZ5MHpxXOKaf",
    "web-and-mobile:w3c-and-whatwg-standards": "s0RvufK2PLMXtlsn2KAUN",
    "architect-frameworks:babok": "LQlzVxUxM3haWRwbhYHKY",
    "architect-frameworks:iaf": "wFu9VO48EYbIQrsM8YUCj",
    "architect-frameworks:uml": "8FTKnAKNL9LnZBrw9YXqK",
    "architect-frameworks:togaf": "5TDTU22Fla2mRr6JeOcaY",
    "architect-frameworks": "hjlkxYZS7Zf9En3IUS-Wm",
    "management": "UyIwiIiKaa6LTQaqzbCam",
    "management:certifications:pmi-itil-prince2-rup": "hRug9yJKYacB9X_2cUalR",
    "management:agile-scrum:less": "qwpsGRFgzAYstM7bJA2ZJ",
    "management:agile-scrum:safe": "Bg7ru1q1j6pNB43HGxnHT",
    "networks": "cBWJ6Duw99tSKr7U6OW3A",
    "networks:osi-tcp-ip-model": "Mt5W1IvuHevNXVRlh7z26",
    "networks:http-https": "Nq6o6Ty8VyNRsvg-UWp7D",
    "networks:proxies": "6_EOmU5GYGDGzmNoLY8cB",
    "networks:firewalls": "Hqk_GGsFi14SI5fgPSoGV",
    "operations-knowledge": "EdJhuNhMSWjeVxGW-RZtL",
    "operations-knowledge:infrastructure-as-code": "igf9yp1lRdAlN5gyQ8HHC",
    "operations-knowledge:cloud-providers": "C0rKd5Rr27Z1_GleoEZxF",
    "operations-knowledge:serverless-concepts": "WoXoVwkSqXTP5U8HtyJOL",
    "operations-knowledge:linux-unix": "XnvlRrOhdoMsiGwGEhBro",
    "operations-knowledge:service-mesh": "OErbfM-H3laFm47GCHNPI",
    "operations-knowledge:ci-cd": "isavRe4ANVn77ZX6gNSLH",
    "operations-knowledge:containers": "l3oeo65FyV5HHvw5n_1wa",
    "operations-knowledge:cloud-design-patterns": "CxceVdaNCyKDhs0huDtcL",
    "enterprise-software": "8yALyPVUZPtd7LX3GrO1e",
    "enterprise-software:ms-dynamics": "gdtI0H_PzzTj_aFQn_NeA",
    "enterprise-software:sap-epr-hana-business-objects": "TxWAznp1tUtZ1MvThf9M1",
    "enterprise-software:emc-dms": "YfYviOXqGVp9C6DuhqBrn",
    "enterprise-software:ibm-bpm": "5EVecZmvor09LjD7WR_Y9",
    "enterprise-software:salesforce": "mOXyzdNn8W-9R99ffcnor"
  },
  "software-architect": "---\njsonUrl: '/jsons/roadmaps/software-architect.json'\npdfUrl: '/pdfs/roadmaps/software-architect.pdf'\nrenderer: 'editor'\norder: 8\nbriefTitle: 'Software Architect'\nbriefDescription: 'Step by step guide to become a Software Architect in 2025'\ntitle: 'Software Architect'\ndescription: 'Step by step guide to becoming a Software Architect in 2025'\nisNew: false\nhasTopics: true\npartner:\n  description: \"Ready-to use free on/offboarding templates for new employees\"\n  link: \"https://www.silo.team/book-a-demo-silo-team?utm_source=affiliate1&utm_medium=referral&utm_campaign=free_onboarding_checklist\"\n  linkText: \"silo.team\"\ncourses:\n  - title: 'Complete Course to Master SQL'\n    description: 'Learn SQL from scratch with this comprehensive course'\n    link: 'https://roadmap.sh/courses/sql'\n    features:\n      - '55+ Lessons'\n      - 'AI Tutor'\n      - 'Coding Environment'\n      - 'Quizzes'\n      - 'Certification'\n    instructor:\n      name: 'Kamran Ahmed'\n      image: 'https://github.com/kamranahmedse.png'\n      title: 'Founder - roadmap.sh'\ndimensions:\n  width: 968\n  height: 2525\nschema:\n  headline: 'Software Architect Roadmap'\n  description: 'Learn to become a Software Architect with this interactive step by step guide in 2025. We also have resources and short descriptions attached to the roadmap items so you can get everything you want to learn in one place.'\n  imageUrl: 'https://roadmap.sh/roadmaps/software-architect.png'\n  datePublished: '2023-01-05'\n  dateModified: '2023-01-20'\nseo:\n  title: 'Software Architect Roadmap'\n  description: 'Community driven, articles, resources, guides, interview questions, quizzes for Software Architect. Learn to become a modern software architect by following the steps, skills, resources and guides listed in this roadmap.'\n  keywords:\n    - 'solution architect roadmap'\n    - 'solution architect roadmap 2025'\n    - 'enterprise architect roadmap'\n    - 'guide to becoming a software architect'\n    - 'db administrator roadmap'\n    - 'software architect roadmap 2025'\n    - 'software architect roadmap'\n    - 'software architect roadmap 2025'\n    - 'software architect skills'\n    - 'db administrator skills'\n    - 'become software architect'\n    - 'modern software architect skills'\n    - 'software architect skills test'\n    - 'skills for software architect'\n    - 'learn software architect'\n    - 'what is software architect'\n    - 'software architect quiz'\n    - 'software architect interview questions'\nrelatedRoadmaps:\n  - 'backend'\n  - 'software-design-architecture'\n  - 'python'\n  - 'golang'\n  - 'java'\n  - 'devops'\nsitemap:\n  priority: 1\n  changefreq: 'monthly'\ntags:\n  - 'roadmap'\n  - 'main-sitemap'\n  - 'role-roadmap'\n---\n"
}